Repository: andrenasturas/hausse
Catalog: docs/locales/*/LC_MESSAGES/introduction.po
Languages: fr

source: Getting Started
fr: Pour commencer

source: What is hausse?
fr: Qu'est-ce que hausse ?

source: **hausse** is a modular project generator, mainly used to build static websites. It collects files from a source folder, process them using a chosen set of plugins, and write them into an output folder.
fr: **hausse** est un générateur de projet modulaire, principalement utilisé pour assembler des sites web statiques. Il collecte les fichiers dans un dossier source, les traite en utilisant un ensemble choisi de plugins, et les écrit dans un dossier de sortie.

source: Hausse plugin-based behaviour is similar to the NodeJS project `Metalsmith <https://metalsmith.io>`_.
fr: Le comportement basé sur des plugins de **hausse** est similaire au projet NodeJS `Metalsmith <https://metalsmith.io>`_.

source: Hausse is shipped with a fair amount of plugins.
fr: **hausse** est accompagné d'un certain nombre de plugins.

source: Hausse is available on `PyPI <https://pypi.org/project/hausse/>`_.
fr: **hausse** est disponible sur `PyPI <https://pypi.org/project/hausse/>`_.

source: In order to generate static websites, you will probably need additional packages:
fr: Dans le but de générer des sites web statiques, vous aurez probablement besoin de paquets additionnels :

source: `markdown2 <https://pypi.org/project/markdown2>`_ for Markdown language processing
fr: `markdown2 <https://pypi.org/project/markdown2>`_ pour le traitement du langage Markdown

source: `pybars3 <https://pypi.org/project/pybars3>`_ for Handlebars templates
fr: `pybars3 <https://pypi.org/project/pybars3>`_ pour les modèles Handlebars

source: Due to the versatility of Hausse, these dependencies are optional and are not automatically installed with it.
fr: Compte tenu de la polyvalence de **hausse**, ces dépendances sont optionnelles et ne sont pas automatiquement installées.

source: Let's build a very simple static website. Write the following into ``src/index.md``.
fr: Commençons par construire un très simple site web statique. Écrivez ce qui suit dans ``src/index.md``.

source: Then, open a Python file and write the following code:
fr: Ensuite, ouvrez un fichier Python et écrivez le code suivant :

source: This code create a new Hausse project in the current directory, summons the **Markdown** plugin and triggers the project build, writing the result in ``dist/index.html``.
fr: Ce code crée un nouveau projet Hausse dans le dossier courant, invoque le plugin **Markdown** et déclenche la compilation du projet, écrivant le résultat dans ``dist/index.html``.

source: That's it ! You now have the basics to build nice static websites.
fr: C'est tout ! Vous avez maintenant les bases pour compiler de sympathiques sites statiques.
